https://www.youtube.com/watch?v=TDwy1lSjEZo


https://towardsdatascience.com/studying-up-for-the-tokyo-2021-olympics-with-sql-719a0ae3779b

https://www.dataquest.io/blog/loading-data-into-postgres/  

https://www.youtube.com/watch?v=wqBFgaMgFQA

In [1]:
import psycopg2
import os
import numpy as np
import pandas.io.sql as sqlio
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns # optional
plt.style.use('ggplot') # optional

In [2]:
# Modify these variables depending on local filepaths
athlete = pd.read_csv("C:/Users/mwamb/Desktop/Desktop/Olympic analysis/data/athlete_events.csv")
region = pd.read_csv("C:/Users/mwamb/Desktop/Desktop/Olympic analysis/data/noc_regions.csv")

In [3]:
# Connect to an existing database
conn = psycopg2.connect("dbname=playground user=postgres password=cirezicinama2109B")

In [4]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [5]:
athlete.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [6]:
region.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [7]:
athlete.dtypes

ID          int64
Name       object
Sex        object
Age       float64
Height    float64
Weight    float64
Team       object
NOC        object
Games      object
Year        int64
Season     object
City       object
Sport      object
Event      object
Medal      object
dtype: object

In [8]:
region.dtypes

NOC       object
region    object
notes     object
dtype: object

In [9]:
# Execute a command: this creates a new table
# Execute a command: this creates a new table
cur.execute("""

CREATE TABLE olympics (
    id SERIAL,
    name VARCHAR,
    sex VARCHAR,
    age VARCHAR,
    height VARCHAR,
    weight VARCHAR,
    team VARCHAR,
    NOC VARCHAR,
    games VARCHAR,
    year INT,
    season VARCHAR,
    city VARCHAR,
    sport VARCHAR,
    event VARCHAR,
    medal VARCHAR
)

""");

In [10]:
# Create the other table
cur.execute("CREATE TABLE noc_regions (noc VARCHAR, region VARCHAR);")

In [11]:
#insert value in the database , before that save pandas dataframe to csv file


my_file = open('C:/Users/mwamb/Desktop/Desktop/Olympic analysis/data/athlete_events.csv')
print("file in memory")

file in memory

In [12]:
## upload to database
SQL_STATEMENT = """
COPY olympics FROM STDIN WITH
    CSV
    DELIMITER AS ',' 
    HEADER;

"""
cur.copy_expert(sql=SQL_STATEMENT, file =my_file )